#+TITLE: What Is Your Problem? 
#+LANGUAGE: en
#+OPTIONS: num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t ':t
#+STARTUP: showeverything entitiespretty

* SISO program solving SortWords
#+name: sort-words
#+BEGIN_SRC python :results silent
  def sortWords(inString):
      words = sorted(inString.split())
      return ' '.join(words)
#+END_SRC

#+BEGIN_SRC python :results output :noweb eval
  <<sort-words>>
  print(sortWords('banana grape banana apple'))
#+END_SRC

#+RESULTS:
: apple banana banana grape

